cases/advection/2Drotation/lent-hex-rotation2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./constant/caseSetup"

application     lentAdvect;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6.283185307179586;

deltaT          0.01;

writeControl    adjustableRunTime;
writeInterval   $endTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  off;

maxCo $CFL; 
maxAlphaCo 10;

maxDeltaT 0.1;

libs ("libtwoPhaseValidation.so"); 

functions
{
    lentAdvect 
    {
        type divFree;
        divFree
        { 
            type rotation;
            axisPoint (0.5 0.5 0.005); 
            V    (0 0 -1);
            cellVelocityName U; 
            volFluxName     phi;
        }
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
