cases/advection/2Drotation/lent-hex-rotation2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./constant/caseSetup"

convertToMeters 1.00;

vertices
(
    (0    0    0)
    (1    0    0)
    (1    1    0)
    (0    1    0)
    (0    0    0.01)
    (1    0    0.01)
    (1    1    0.01)
    (0    1    0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($N $N 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left 
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {   
        type cyclic;
        neighbourPatch left;
        faces
        (
            (2 6 5 1)
        );
    }

    front
    {   
        type cyclic;
        neighbourPatch back;
        faces
        (
            (1 5 4 0)
        );
    }
    back
    {   
        type cyclic;
        neighbourPatch front;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
