cases/advection/2Drotation/lent-hex-rotation2D/system/lentSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      lentSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

distanceCalculator
{
    type            optimizedOctree;
    narrowBandWidth 2;
    narrowBandPropagation
    {
        type            naiveNarrowBand;
    }
}

frontReconstructionModel
{
    type            timeStepInterval;
    value           0;
}

frontReconstructor
{
    type            foamIsoSurface;
    mergeTolerance  1e-06;
    regularization  on;
    normalConsistency
    {
        type            centerNormal;
        cellDistance    signedDistance;
        pointDistance   pointSignedDistance;
    }
}

markerFieldModel
{
    type            tetFillingLevel;
    cellDistance    signedDistance;
    pointDistance   pointSignedDistance;
    nSmoothingSteps 0;
}

frontMotionSolver
{
    type            Euler;
    cellToVertexInterpolation cellPoint;
}

surfaceTensionForceModel
{
    type            CSF;
    filterField     alpha.water;
    curvatureModel
    {
        type            divGrad;
        curvatureField  signedDistance;
    }
}


// ************************************************************************* //
